Revit 2026 API
IFCCategoryTemplate.SetActiveTemplate Method
 Sets the mapping template element to be the active mapping template for its document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public void SetActiveTemplate()
Public Sub SetActiveTemplate
public:
void SetActiveTemplate()
member SetActiveTemplate : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  Invalid use of in-session template.
See Also
Reference
IFCCategoryTemplate Class
SetActiveTemplate Overload
Autodesk.Revit.DB Namespace